In [1]:
import requests

In [2]:
response = requests.get('https://python.zach.lol/api/v1/items')

data = response.json()
data.keys()

dict_keys(['payload', 'status'])

In [3]:
import pandas as pd

df = pd.DataFrame(data['payload']['items'])
df.head()

,item_brand,item_id,item_name,item_price,item_upc12,item_upc14
0,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013
1,Caress,2,Caress Velvet Bliss Ultra Silkening Beauty Bar...,6.44,11111065925,11111065925
2,Earths Best,3,Earths Best Organic Fruit Yogurt Smoothie Mixe...,2.43,23923330139,23923330139
3,Boars Head,4,Boars Head Sliced White American Cheese - 120 Ct,3.14,208528800007,208528800007
4,Back To Nature,5,Back To Nature Gluten Free White Cheddar Rice ...,2.61,759283100036,759283100036

In [4]:
response = requests.get('https://python.zach.lol/api/v1/items')

data = response.json()
data.keys()

dict_keys(['payload', 'status'])

**Using the code from the lesson as a guide, create a dataframe named items that has all of the data for items.**

In [5]:
def new_payload_items_data():
    df = pd.DataFrame(data['payload']['items'])
    df.to_csv('new_items_df.csv')
    return df

In [6]:
items = new_payload_items_data()

In [7]:
items.head()

,item_brand,item_id,item_name,item_price,item_upc12,item_upc14
0,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013
1,Caress,2,Caress Velvet Bliss Ultra Silkening Beauty Bar...,6.44,11111065925,11111065925
2,Earths Best,3,Earths Best Organic Fruit Yogurt Smoothie Mixe...,2.43,23923330139,23923330139
3,Boars Head,4,Boars Head Sliced White American Cheese - 120 Ct,3.14,208528800007,208528800007
4,Back To Nature,5,Back To Nature Gluten Free White Cheddar Rice ...,2.61,759283100036,759283100036

**Do the same thing, but for stores.**

In [8]:
response = requests.get('https://python.zach.lol/api/v1/stores')

data = response.json()
data.keys()

dict_keys(['payload', 'status'])

In [9]:
def new_payload_stores_data():
    df = pd.DataFrame(data['payload']['stores'])
    df.to_csv('new_stores_df.csv')
    return df

In [10]:
stores = new_payload_stores_data()

In [11]:
stores.head()

             store_address   store_city  store_id store_state store_zipcode
0   12125 Alamo Ranch Pkwy  San Antonio         1          TX         78253
1         9255 FM 471 West  San Antonio         2          TX         78251
2  2118 Fredericksburg Rdj  San Antonio         3          TX         78201
3          516 S Flores St  San Antonio         4          TX         78204
4          1520 Austin Hwy  San Antonio         5          TX         78218

**Extract the data for sales. There are a lot of pages of data here, so your code will need to be a little more complex. Your code should continue fetching data from the next page until all of the data is extracted.**

In [12]:
response = requests.get('https://python.zach.lol/api/v1/sales')

data = response.json()
data.keys()

dict_keys(['payload', 'status'])

In [13]:
df = pd.DataFrame(data['payload']['sales'])
df.head()

   item  sale_amount                      sale_date  sale_id  store
0     1         13.0  Tue, 01 Jan 2013 00:00:00 GMT        1      1
1     1         11.0  Wed, 02 Jan 2013 00:00:00 GMT        2      1
2     1         14.0  Thu, 03 Jan 2013 00:00:00 GMT        3      1
3     1         13.0  Fri, 04 Jan 2013 00:00:00 GMT        4      1
4     1         10.0  Sat, 05 Jan 2013 00:00:00 GMT        5      1

In [14]:
df.shape

(5000, 5)

In [15]:
def new_payload_sales_data():
    df = pd.DataFrame(data['payload']['sales'])
    df.to_csv('new_sales_df.csv')
    return df

In [16]:
sales = new_payload_sales_data()

In [17]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   item         5000 non-null   int64
 1   sale_amount  5000 non-null   float64
 2   sale_date    5000 non-null   object
 3   sale_id      5000 non-null   int64
 4   store        5000 non-null   int64
dtypes: float64(1), int64(3), object(1)
memory usage: 195.4+ KB

In [18]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   store_address  10 non-null     object
 1   store_city     10 non-null     object
 2   store_id       10 non-null     int64
 3   store_state    10 non-null     object
 4   store_zipcode  10 non-null     object
dtypes: int64(1), object(4)
memory usage: 528.0+ bytes

In [19]:
items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   item_brand  20 non-null     object
 1   item_id     20 non-null     int64
 2   item_name   20 non-null     object
 3   item_price  20 non-null     float64
 4   item_upc12  20 non-null     object
 5   item_upc14  20 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.1+ KB

In [20]:
sales.rename(columns = {'item':'item_id'}, inplace = True)

In [21]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   item_id      5000 non-null   int64
 1   sale_amount  5000 non-null   float64
 2   sale_date    5000 non-null   object
 3   sale_id      5000 non-null   int64
 4   store        5000 non-null   int64
dtypes: float64(1), int64(3), object(1)
memory usage: 195.4+ KB

In [22]:
first_merge = pd.merge(items, sales, how ='outer', on ='item_id')

In [23]:
first_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5019 entries, 0 to 5018
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   item_brand   5019 non-null   object
 1   item_id      5019 non-null   int64
 2   item_name    5019 non-null   object
 3   item_price   5019 non-null   float64
 4   item_upc12   5019 non-null   object
 5   item_upc14   5019 non-null   object
 6   sale_amount  5000 non-null   float64
 7   sale_date    5000 non-null   object
 8   sale_id      5000 non-null   float64
 9   store        5000 non-null   float64
dtypes: float64(4), int64(1), object(5)
memory usage: 431.3+ KB

In [24]:
first_merge.head()

,item_brand,item_id,item_name,item_price,item_upc12,item_upc14,sale_amount,sale_date,sale_id,store
0,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013,13.0,"Tue, 01 Jan 2013 00:00:00 GMT",1.0,1.0
1,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013,11.0,"Wed, 02 Jan 2013 00:00:00 GMT",2.0,1.0
2,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013,14.0,"Thu, 03 Jan 2013 00:00:00 GMT",3.0,1.0
3,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013,13.0,"Fri, 04 Jan 2013 00:00:00 GMT",4.0,1.0
4,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013,10.0,"Sat, 05 Jan 2013 00:00:00 GMT",5.0,1.0

In [25]:
first_merge.rename(columns = {'store':'store_id'}, inplace = True)

In [26]:
df = pd.merge(first_merge, stores, how ='outer', on ='store_id')

In [27]:
df.head()

,item_brand,item_id,item_name,item_price,item_upc12,item_upc14,sale_amount,sale_date,sale_id,store_id,store_address,store_city,store_state,store_zipcode
0,Riceland,1.0,Riceland American Jazmine Rice,0.84,35200264013,35200264013,13.0,"Tue, 01 Jan 2013 00:00:00 GMT",1.0,1.0,12125 Alamo Ranch Pkwy,San Antonio,TX,78253
1,Riceland,1.0,Riceland American Jazmine Rice,0.84,35200264013,35200264013,11.0,"Wed, 02 Jan 2013 00:00:00 GMT",2.0,1.0,12125 Alamo Ranch Pkwy,San Antonio,TX,78253
2,Riceland,1.0,Riceland American Jazmine Rice,0.84,35200264013,35200264013,14.0,"Thu, 03 Jan 2013 00:00:00 GMT",3.0,1.0,12125 Alamo Ranch Pkwy,San Antonio,TX,78253
3,Riceland,1.0,Riceland American Jazmine Rice,0.84,35200264013,35200264013,13.0,"Fri, 04 Jan 2013 00:00:00 GMT",4.0,1.0,12125 Alamo Ranch Pkwy,San Antonio,TX,78253
4,Riceland,1.0,Riceland American Jazmine Rice,0.84,35200264013,35200264013,10.0,"Sat, 05 Jan 2013 00:00:00 GMT",5.0,1.0,12125 Alamo Ranch Pkwy,San Antonio,TX,78253

Acquire the Open Power Systems Data for Germany, which has been rapidly expanding its renewable energy production in recent years. The data set includes country-wide totals of electricity consumption, wind power production, and solar power production for 2006-2017. You can get the data here: https://raw.githubusercontent.com/jenfly/opsd/master/opsd_germany_daily.csv

In [28]:
germany = pd.read_csv('https://raw.githubusercontent.com/jenfly/opsd/master/opsd_germany_daily.csv')

In [29]:
germany.head()

         Date  Consumption  Wind  Solar  Wind+Solar
0  2006-01-01     1069.184   NaN    NaN         NaN
1  2006-01-02     1380.521   NaN    NaN         NaN
2  2006-01-03     1442.533   NaN    NaN         NaN
3  2006-01-04     1457.217   NaN    NaN         NaN
4  2006-01-05     1477.131   NaN    NaN         NaN

In [30]:
germany.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4383 entries, 0 to 4382
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         4383 non-null   object
 1   Consumption  4383 non-null   float64
 2   Wind         2920 non-null   float64
 3   Solar        2188 non-null   float64
 4   Wind+Solar   2187 non-null   float64
dtypes: float64(4), object(1)
memory usage: 171.3+ KB

In [31]:
# def new_payload_sales_data():
#     response = requests.get('https://python.zach.lol/api/v1/items')
#     data = response.json()
#     df = pd.DataFrame(data['payload']['sales'])
#     df.to_csv('new_sales_df.csv')
#     return df

In [32]:
response = requests.get('https://python.zach.lol/api/v1/sales')
data = response.json()
df = pd.DataFrame(data['payload']['sales'])

In [33]:
df.head()

   item  sale_amount                      sale_date  sale_id  store
0     1         13.0  Tue, 01 Jan 2013 00:00:00 GMT        1      1
1     1         11.0  Wed, 02 Jan 2013 00:00:00 GMT        2      1
2     1         14.0  Thu, 03 Jan 2013 00:00:00 GMT        3      1
3     1         13.0  Fri, 04 Jan 2013 00:00:00 GMT        4      1
4     1         10.0  Sat, 05 Jan 2013 00:00:00 GMT        5      1

In [34]:
i=2
for page in range(1,183):
    response = requests.get('https://python.zach.lol/api/v1/sales?page={}'.format(i))
    data = response.json()
    df = pd.concat([df, pd.DataFrame(data['payload']['sales'])])
    i = i + 1
    
df = df.reset_index()
df.head()

   index  item  sale_amount                      sale_date  sale_id  store
0      0     1         13.0  Tue, 01 Jan 2013 00:00:00 GMT        1      1
1      1     1         11.0  Wed, 02 Jan 2013 00:00:00 GMT        2      1
2      2     1         14.0  Thu, 03 Jan 2013 00:00:00 GMT        3      1
3      3     1         13.0  Fri, 04 Jan 2013 00:00:00 GMT        4      1
4      4     1         10.0  Sat, 05 Jan 2013 00:00:00 GMT        5      1

In [35]:
sales = df

In [36]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 913000 entries, 0 to 912999
Data columns (total 6 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   index        913000 non-null  int64
 1   item         913000 non-null  int64
 2   sale_amount  913000 non-null  float64
 3   sale_date    913000 non-null  object
 4   sale_id      913000 non-null  int64
 5   store        913000 non-null  int64
dtypes: float64(1), int64(4), object(1)
memory usage: 41.8+ MB

In [37]:
sales.rename(columns = {'item':'item_id'}, inplace = True)

In [38]:
first_merge = pd.merge(items, sales, how ='outer', on ='item_id')

In [39]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   store_address  10 non-null     object
 1   store_city     10 non-null     object
 2   store_id       10 non-null     int64
 3   store_state    10 non-null     object
 4   store_zipcode  10 non-null     object
dtypes: int64(1), object(4)
memory usage: 528.0+ bytes